app/Http/Controllers/Front/HomeController.php

    public function getHome()
    {
        $data['source'] = BdtdcSupplierInquery::with(['sender_company','sender_company.country','bdtdc_product','bdtdc_product.product_name','inq_docs_one','inq_products_category','inq_products_category.pro_parent_cat','inq_products_category.bdtdcCategory','inq_products_category.bdtdcCategory','bdtdc_product','inq_unit_id','inq_products_image','inq_products_images','home_inquiry'])
            ->where('is_RFQ',1)
            ->orderBy('id','DESC')
            ->where('active',1)
            ->take(15)->get();


        $data['products'] = BdtdcHomeProduct::with(['bdtdcProduct','bdtdcProduct.product_image_new','bdtdcProduct.product_name','bdtdcProduct.product_prices','bdtdcProduct.ProductUnit'])
            ->where('whole_sale',1)
            ->orderBy('sort','asc')->take(15)->get();

        $data['product_homes'] = BdtdcHomeProduct::with(['bdtdcProduct','bdtdcProduct.product_image_new','bdtdcProduct.product_name','bdtdcProduct.product_prices','bdtdcProduct.ProductUnit'])->where('hot_product',1)->orderBy('sort','asc')->take(15)->get();


        $data['product_bangladesh'] = BdtdcHomeProduct::with(['bdtdcProduct','bdtdcProduct.product_image_new','bdtdcProduct.product_name'])
                ->where('bangladesh_products',1)
                ->orderBy('sort','asc')->take(15)->get();


        $data['country']=BdtdcCountry::where('status',0)->take(6)->get();

        $data['toplink']=BdtdcCategory::where('top',0)->take(8)->get();



        $homepage="home";
        // dd($most_view);
        $header=BdtdcPageSeo::where('page_id',1)->first();
---
select * from `bdtdc_product` where `bdtdc_product`.`id` in (0)
select * from `bdtdc_product_images` where `bdtdc_product_images`.`product_id` in ('')
select * from `bdtdc_product_unit` where `bdtdc_product_unit`.`id` in (9, 14, 18, 24)
select * from `bdtdc_home_products` where `whole_sale` = 1 order by `sort` asc limit 15
select * from `bdtdc_product` where `bdtdc_product`.`id` in (5770)
select * from `bdtdc_home_products` where `hot_product` = 1 order by `sort` asc limit 15
select * from `bdtdc_product_images` where `bdtdc_product_images`.`product_id` in (5935)
select * from `bdtdc_product_prices` where `bdtdc_product_prices`.`product_id` in (5935)
select * from `bdtdc_product_unit` where `bdtdc_product_unit`.`id` in (9)
select * from `bdtdc_home_products` where `bangladesh_products` = 1 order by `sort` asc limit 15
select * from `bdtdc_product` where `bdtdc_product`.`id` in (5770, 6046, 6106, 6736)
select * from `bdtdc_country` where `status` = 0 limit 6
select * from `bdtdc_category` where `top` = 0 limit 8
select * from `bdtdc_page_seo` where `page_id` = 1 limit 1