app/Http/Controllers/SessionsController.php

    public function create($return_url=null)
    {

        if(Sentinel::check()){
            return redirect('/');
        }
        $header=BdtdcPageSeo::where('page_id',147)->first();
---
select * from `bdtdc_page_seo` where `page_id` = 147 limit 1