app/Http/Controllers/Front/UserEnd/ProductController.php

select * from `bdtdc_country` where `id` = 'home-page' limit 1
select * from `bdtdc_country` where `name` = 'bdtdc' limit 1
---
    public function category_productList(Request $r,$name,$cat_name,$id,$cat_id)
    {
        $categoryid=$cat_id;
        $countryid=$id;
        $search_str = $r->search_str;
        $origin = $r->origin;
        $country_name=BdtdcCountry::where('id',$countryid)->first();

        $header=BdtdcCategoryDescription::with(['sub_cat'=>function ($q){
                                            $q->take(15);
                                        },'cat_name'])->where('category_id',$categoryid)->first();

        $ff=explode('-',$name);
        $fff=$ff[0];

        $country_na=BdtdcCountry::where('name',$fff)->first();

select * from `bdtdc_category` where `bdtdc_category`.`id` in (14, 15, 19, 246)
select * from `bdtdc_product_prices` where `bdtdc_product_prices`.`product_id` in (5547, 5548, 5549, 5550, 5551, 5552, 5553, 5560, 5659, 5660, 5661, 5662, 5663, 5664, 5665)
select * from `bdtdc_product_to_category` where `parent_id` = '1.png' and `is_active` = 1 and exists (select * from `bdtdc_companies` where `bdtdc_product_to_category`.`company_id` = `bdtdc_companies`.`id` order by `sort` desc) order by `product_id` desc limit 15 offset 0
select * from `bdtdc_product_unit` where `bdtdc_product_unit`.`id` in (9)
---
            $products=$product_data->paginate();
            if(count($products) > 0){
            }else{
                $products=BdtdcProductToCategory::with(['cat_country','pro_to_cat_name','bdtdcProduct','bdtdcProduct.product_prices','bdtdcProduct.ProductUnit','bdtdcProduct.product_country','bdtdcProduct.customer_activity','bdtdcProduct.supplier_product','supp_pro_company','supp_pro_company_name','bdtdcCategory','pro_parent_cat','pro_images','pro_images_new'])->where('parent_id',$cat_id)
                    ->where('is_active',1)
                    ->whereHas('supp_company',function($qu){
                        $qu->orderBy('sort','desc');
                })
                    ->orderBy('product_id','desc')
                    ->paginate();

select * from `bdtdc_category` where `id` = '1.png' limit 1
select * from `bdtdc_country` where `bdtdc_country`.`region_id` in (258, 259, 260, 261, 262)
select * from `bdtdc_country` where `region_id` != 1
---
            }
        }

        $category_id=BdtdcCategory::where('id',$cat_id)->first();

        $country=BdtdcCountry::with('country_region')->where('region_id',1)->get();

        $bdtdc_country_list=BdtdcCountry::where('region_id','!=',1)->get();

select * from `bdtdc_category` where `bdtdc_category`.`parent_id` in (1)
---

        if($category_id->parent_id==0)
        {
            $parent_cats=BdtdcCategory::with('parent_cat')->where('id',$cat_id)->first();

update `bdtdc_product` set `visits` = 1297, `updated_at` = '2020-12-11 00:35:26' where `id` = 5938
select * from `bdtdc_product_to_category` where `bdtdc_product_to_category`.`product_id` in (5938)
select * from `bdtdc_product` where `bdtdc_product`.`id` in (865, 919, 1010, 4540, 5850, 5898, 5967, 10363)
select * from `bdtdc_category` where `id` = 1 limit 1
---
    public function get_product_show($name, $id)
    {
        $p_id=substr($id, 9, 10);
        if(Sentinel::getUser()){
            $products=BdtdcProduct::with(['logistic_info','bdtdcProductToCategory.other_wholesalers_products','bdtdcProductToCategory.other_wholesalers_products.pro_images_new','bdtdcProductToCategory.other_wholesalers_products.category_product_name','bdtdcProductToCategory.other_wholesalers_products.cat_pro_price','bdtdcProductToCategory.other_wholesalers_products.bdtdcProduct','bdtdcProductToCategory.other_wholesalers_products.bdtdcProduct.ProductUnit','customer_activity','bdtdcProductToCategory','bdtdcProductToCategory.other_wholesalers_products','bdtdcProductToCategory.bdtdcCategory','bdtdcProductToCategory.supp_pro_company','bdtdcProductToCategory.supp_pro_company.users','bdtdcProductToCategory.supp_pro_company_name','bdtdcProductToCategory.cat_country','product_name','supplier_product','supplier_product.suppliers','supplier_product.suppliers.business_types','product_image','ProductUnit','proimages','product_image_new','proimages_new','product_prices','ProductUnit','product_attribute','supplier_product.users','bdtdcProductToCategory.suppliers_other_products','bdtdcProductToCategory.suppliers_other_products.category_product_name','bdtdcProductToCategory.suppliers_other_products.pro_images_new','bdtdcProductToCategory.suppliers_other_products.cat_pro_price','bdtdcProductToCategory.suppliers_other_products.bdtdcProduct.ProductUnit','bdtdcProductToCategory.factoryinfo','bdtdcProductToCategory.factoryinfo.form_qc_staff','bdtdcProductToCategory.factoryinfo.form_factory_size','bdtdcProductToCategory.bdtdc_main_market','bdtdcProductToCategory.tradeinfo.form_export_percentage','bdtdcProductToCategory.tradeinfo.BdtdcFormValue','supplier_product.sup_main_products','supplier_product.suppliers.business_types','supplier_product.sup_companies.name_string','supplier_product.sup_companies','bdtdcProductToCategory.supplier_patents','customer_activity'=>function($subQuery){
                $subQuery->where('customer_id',Sentinel::getUser()->id);
            },'product_image_new'=>function($subQ){
                $subQ->orderBy('id','asc');
            },'proimages_new'=>function($subQ){
                $subQ->orderBy('id','asc');
            },'product_attribute'=>function($subQ){
                $subQ->orderBy('id','asc');
            }])
            ->where('id',$p_id)
            ->first();
        }
        else{
            $products=BdtdcProduct::with(['logistic_info','bdtdcProductToCategory.other_wholesalers_products','bdtdcProductToCategory.other_wholesalers_products.pro_images_new','bdtdcProductToCategory.other_wholesalers_products.category_product_name','bdtdcProductToCategory.other_wholesalers_products.cat_pro_price','bdtdcProductToCategory.other_wholesalers_products.bdtdcProduct','bdtdcProductToCategory.other_wholesalers_products.bdtdcProduct.ProductUnit','customer_activity','bdtdcProductToCategory','bdtdcProductToCategory.other_wholesalers_products','bdtdcProductToCategory.bdtdcCategory','bdtdcProductToCategory.supp_pro_company','bdtdcProductToCategory.supp_pro_company.users','bdtdcProductToCategory.supp_pro_company_name','bdtdcProductToCategory.cat_country','product_name','supplier_product','supplier_product.suppliers','supplier_product.suppliers.business_types','product_image','ProductUnit','proimages','product_image_new','proimages_new','product_prices','ProductUnit','product_attribute','product_attribute.bdtdcAttribute','supplier_product.users','bdtdcProductToCategory.suppliers_other_products','bdtdcProductToCategory.suppliers_other_products.category_product_name','bdtdcProductToCategory.suppliers_other_products.pro_images_new','bdtdcProductToCategory.suppliers_other_products.cat_pro_price','bdtdcProductToCategory.suppliers_other_products.bdtdcProduct.ProductUnit','bdtdcProductToCategory.factoryinfo','bdtdcProductToCategory.factoryinfo.form_qc_staff','bdtdcProductToCategory.factoryinfo.form_factory_size','bdtdcProductToCategory.bdtdc_main_market','bdtdcProductToCategory.tradeinfo.form_export_percentage','bdtdcProductToCategory.tradeinfo.BdtdcFormValue','supplier_product.sup_main_products','supplier_product.suppliers.business_types','supplier_product.sup_companies.name_string','supplier_product.sup_companies','bdtdcProductToCategory.supplier_patents','supplier_product.sup_companies.country','bdtdcProductToCategory.supp_pro_company.users','bdtdcProductToCategory.supplier_trademarks','bdtdcProductToCategory.other_wholesalers_products.cat_pro_price'])->where('id',$p_id)
                    ->first();
        }

        if($products){
            $products->visits = $products->visits + 1;
            $products->save();
        }
        if(!$products){
            return '<div style="margin:0 auto;width:23%;margin-top:10%;border:1px double rebeccapurple;"><h1 style="text-align:center;color:forestgreen;">No Product Found!!!</h1><p style="text-align:center;"><a style="text-decoration:none;" href="/">Go to home page</a></p></div>';
        }

        if($products->bdtdcProductToCategory){
            $parent_id=BdtdcCategory::where('id',$products->bdtdcProductToCategory->parent_id)->first();

select * from `bdtdc_product_unit`
---
                                        );
        }

        $units=DB::table('bdtdc_product_unit')->get();